php_api/xml_request.txt

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://schemas.datacontract.org/2004/07/SAPI.Entities.WayBillGeneration" xmlns:ns2="http://tempuri.org/" xmlns:ns3="http://schemas.datacontract.org/2004/07/SAPI.Entities.Admin" xmlns:ns4="http://www.w3.org/2005/08/addressing"><env:Header><ns4:Action env:mustUnderstand="true">http://tempuri.org/IWayBillGeneration/GenerateWayBill</ns4:Action></env:Header><env:Body><ns2:GenerateWayBill><ns2:Request><ns1:Consignee><ns1:ConsigneeAddress1>B1203, 24K Glitterati 2, </ns1:ConsigneeAddress1><ns1:ConsigneeAddress2> Vishal Nagar, Pimple Nilakh</ns1:ConsigneeAddress2><ns1:ConsigneeAddress3></ns1:ConsigneeAddress3><ns1:ConsigneeAttention>Mrugnayani Mandore</ns1:ConsigneeAttention><ns1:ConsigneeCityName>PUNE</ns1:ConsigneeCityName><ns1:ConsigneeCountryCode>IN</ns1:ConsigneeCountryCode><ns1:ConsigneeEmailID></ns1:ConsigneeEmailID><ns1:ConsigneeMobile>9833110558</ns1:ConsigneeMobile><ns1:ConsigneeName>MRUGNAYANI MANDORE</ns1:ConsigneeName><ns1:ConsigneePincode>411027</ns1:ConsigneePincode><ns1:ConsigneeStateCode></ns1:ConsigneeStateCode><ns1:ConsigneeTelephone>9833110558</ns1:ConsigneeTelephone></ns1:Consignee><ns1:Services><ns1:AWBNo></ns1:AWBNo><ns1:ActualWeight>5</ns1:ActualWeight><ns1:CessCharge>0</ns1:CessCharge><ns1:CollectableAmount>0</ns1:CollectableAmount><ns1:Commodity><ns1:CommodityDetail1>MATERNITY KIT</ns1:CommodityDetail1><ns1:CommodityDetail2></ns1:CommodityDetail2><ns1:CommodityDetail3></ns1:CommodityDetail3></ns1:Commodity><ns1:CreditReferenceNo>102020082203</ns1:CreditReferenceNo><ns1:CurrencyCode>INR</ns1:CurrencyCode><ns1:DeclaredValue>1000</ns1:DeclaredValue><ns1:Dimensions><ns1:Dimension><ns1:Breadth>40</ns1:Breadth><ns1:Count>1</ns1:Count><ns1:Height>30</ns1:Height><ns1:Length>50</ns1:Length></ns1:Dimension></ns1:Dimensions><ns1:InvoiceNo></ns1:InvoiceNo><ns1:PackType></ns1:PackType><ns1:PickupDate>2022-08-20T00:00:00</ns1:PickupDate><ns1:PickupTime>1140</ns1:PickupTime><ns1:PieceCount>1</ns1:PieceCount><ns1:ProductCode>E</ns1:ProductCode><ns1:ProductType>Dutiables</ns1:ProductType><ns1:RegisterPickup>false</ns1:RegisterPickup><ns1:SpecialInstruction></ns1:SpecialInstruction><ns1:SubProductCode></ns1:SubProductCode></ns1:Services><ns1:Shipper><ns1:CustomerAddress1>MAGARPATTA CITY</ns1:CustomerAddress1><ns1:CustomerAddress2></ns1:CustomerAddress2><ns1:CustomerAddress3></ns1:CustomerAddress3><ns1:CustomerCode>061622</ns1:CustomerCode><ns1:CustomerEmailID></ns1:CustomerEmailID><ns1:CustomerGSTNumber></ns1:CustomerGSTNumber><ns1:CustomerMobile>9158057999</ns1:CustomerMobile><ns1:CustomerName>AKOLKAR POOJA 17378</ns1:CustomerName><ns1:CustomerPincode>411013</ns1:CustomerPincode><ns1:CustomerTelephone>9158057999</ns1:CustomerTelephone><ns1:OriginArea>PNQ</ns1:OriginArea><ns1:Sender>JD 15</ns1:Sender><ns1:VendorCode></ns1:VendorCode></ns1:Shipper></ns2:Request><ns2:Profile><ns3:Api_type>S</ns3:Api_type><ns3:LicenceKey>jezfu7vfhn3solmnk4nqhnnppegrprmr</ns3:LicenceKey><ns3:LoginID>PNQ22140</ns3:LoginID><ns3:Version>1.10</ns3:Version></ns2:Profile></ns2:GenerateWayBill></env:Body></env:Envelope>
